Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G06C.tmx
Source language: en_us
Languages: zh_cn

source: Discovering George Washington
zh_cn: 乔治·华盛顿揭秘

source: Washington's birth record does not include a middle name.
zh_cn: 华盛顿的出生记录上，没有中名。（并非出身名门望族）

source: Upon the death of his father, Augustine, Washington became an 11-year-old owner of ten slaves.
zh_cn: 华盛顿的父亲奥古斯丁死后，11岁的华盛顿成了10个奴隶的主人。

source: Washington's formal education ended when he was around 15 years old.
zh_cn: 大约15岁时，华盛顿不再接受正规教育。

source: Washington stood six feet, three inches tall.
zh_cn: 华盛顿站起来高6英尺3英寸。

source: He started losing his teeth in his twenties.
zh_cn: 华盛顿20岁时开始掉牙。

source: The National Museum of Dentistry in Baltimore, Md., has on display one of Washington's lower denturesЁЊmade from gold, ivory and lead, as well as human and animal teeth.
zh_cn: 马里兰州巴尔的摩国家牙科博物馆的展品中有华盛顿的下半副假牙，用金子、象牙、铅还有人和动物的牙齿制成。

source: The only time Washington traveled out of the country was to Barbados in 1751 with his brother Lawrence who was suffering from tuberculosis.
zh_cn: 华盛顿唯一一次出国是在1751年陪身患结核病的哥哥到巴巴罗伦斯。

source: He and Martha were both 27 when they married.
zh_cn: 华盛顿和玛莎结婚时，两人都是27岁。

source: Martha, who had first been married at 18, was one of the wealthiest widows in the Tidewater region of eastern Virginia when she married Washington.
zh_cn: 玛莎18岁时第一次结婚。她和华盛顿结婚时是佛吉尼亚州东部沿海低洼地区最富有的寡妇之一。

source: Only one of her four children with her first husband Daniel Custis survived to adulthood.
zh_cn: 她和前夫丹尼尔·卡斯蒂斯生了四个孩子，其中三个还没成年就死了。

source: When Washington inherited Mount Vernon from his brother, the plantation was 2,000 acres.
zh_cn: 华盛顿继承哥哥的芒特弗农庄园时，种植面积为2000亩。

source: By the time of George's death in 1799, it was 8,000 acres.
zh_cn: 1799年华盛顿去世时，种植面积已经达到8000亩。
